configXML/Documents/КурсыОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>КурсыОбучения</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПрактическогоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПрохождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийОбучающегосяОбязателен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КартинкиТекстовыхБлоков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторТекстовогоБлока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширениеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Обучающиеся</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Респондент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТекстовыеБлоки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаголовокТекстовогоБлока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторТекстовогоБлока</Name>
							<Comment>Служебное поле</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШаблоныАнкет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШаблонАнкеты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныАнкет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

configXML/InformationRegisters/ДанныеРеспондентовКурсовОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеРеспондентовКурсовОбучения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОзнакомленияСТеорией</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыполненияПрактическойЧасти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КурсОбучения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КурсыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Респондент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

configXML/Documents/НазначениеОпросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НазначениеОпросов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныАнкет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРеспондентов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Респондент</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможностьПредварительногоСохранения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободныйОпрос</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьВАрхивеАнкет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КурсыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Респонденты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Респондент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Респондент</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

configXML/Documents/КурсыОбучения/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	АктуализироватьСвязанныеДанныеКурса(Отказ, ПолучитьИдентификаторОперацииПроведения());
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	АктуализироватьСвязанныеДанныеКурса(Отказ, ПолучитьИдентификаторОперацииОтменаПроведения());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура АктуализироватьСвязанныеДанныеКурса(Отказ, ИдентификаторОперации)
	
	СоздатьАктуализироватьНазначенияОпросов(Отказ, ИдентификаторОперации);
	СоздатьАктуализироватьЗаданияРеспондентам(Отказ, ИдентификаторОперации);
	
	АктуализироватьРегистрДанныеРеспондентовКурсовОбучения(Отказ);
	
КонецПроцедуры

// Создает/актуализирует информацию опросов. Добавляет/удаляет респондентов.
Процедура СоздатьАктуализироватьНазначенияОпросов(Отказ, ИдентификаторОперации)

	ДанныеСвязанныхНазначенийОпросов = ПолучитьДанныеСвязанныхНазначенийОпросов(Ссылка);
	
	Для Каждого ОписаниеДанных Из ДанныеСвязанныхНазначенийОпросов Цикл
	
		Если ИдентификаторОперации = "Проведение" Тогда
		
			Если ОписаниеДанных.НазначениеОпросаСсылка.Пустая() Тогда
				
				// Создаем назначение опроса.
				ПараметрыСоздания = Новый Структура();
				ПараметрыСоздания.Вставить("Основание", Ссылка);
				ПараметрыСоздания.Вставить("ШаблонАнкеты", ОписаниеДанных.ШаблонАнкетыСсылка);
				ПараметрыСоздания.Вставить("ОснованиеНаименование", Наименование);
				ПараметрыСоздания.Вставить("Респонденты", Обучающиеся.Выгрузить());
				СоздатьНазначениеОпросаНаОснованииДанныхКурса(ПараметрыСоздания);
				
			ИначеЕсли ОписаниеДанных.ШаблонАнкетыСсылка.Пустая() Тогда
				
				// Связь идет по основанию и по шаблону анкеты.
				// Если шаблон был удален из таблицы курса, разрываем связь и помечаем назначение на удаление.
				НазначениеОпросаОбъект = ОписаниеДанных.НазначениеОпросаСсылка.ПолучитьОбъект();
				НазначениеОпросаОбъект.Основание = Документы.КурсыОбучения.ПустаяСсылка();
				НазначениеОпросаОбъект.Записать(РежимЗаписиДокумента.Запись);
				// Вызов недопустим, если объект модифицирован, поэтому основание затираем записью выше.
				НазначениеОпросаОбъект.УстановитьПометкуУдаления(Истина);
				
			ИначеЕсли ОписаниеДанных.Проведен = Ложь И Не ОписаниеДанных.ШаблонАнкетыСсылка.Пустая() Тогда
				
				// Проведем назначения, возобновив таким образом видимость анкеты для обучающихся.
				НазначениеОпросаОбъект = ОписаниеДанных.НазначениеОпросаСсылка.ПолучитьОбъект();
				// Обновим состав пользователей.
				НазначениеОпросаОбъект.Респонденты.Загрузить(Обучающиеся.Выгрузить());
				НазначениеОпросаОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
			КонецЕсли;
			
		Иначе
		
			Если ОписаниеДанных.Проведен = Истина И Не ОписаниеДанных.ШаблонАнкетыСсылка.Пустая() Тогда
				
				// Проведем назначения, возобновив таким образом видимость анкеты для обучающихся.
				НазначениеОпросаОбъект = ОписаниеДанных.НазначениеОпросаСсылка.ПолучитьОбъект();
				// Обновим состав пользователей.
				НазначениеОпросаОбъект.Респонденты.Загрузить(Обучающиеся.Выгрузить());
				НазначениеОпросаОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

// Создает/актуализирует задания на респондентов с предметом курса обучения.
Процедура СоздатьАктуализироватьЗаданияРеспондентам(Отказ, ИдентификаторОперации)

	ДанныеСвязанныхЗаданий = ПолучитьДанныеСвязанныхЗадач(Ссылка, Обучающиеся.Выгрузить());

	НачатьТранзакцию();
	
	Попытка
		
		Для Каждого ОписаниеДанных Из ДанныеСвязанныхЗаданий Цикл
			
			Если ИдентификаторОперации = "Проведение" Тогда
				
				Если ОписаниеДанных.Выполнено = Истина ИЛИ ОписаниеДанных.Завершен = Истина Тогда
					// Выполненные и завершенные задания не могут быть изменены с помощью методов Библиотеки Стандартных Подсистем.
					Продолжить;
				ИначеЕсли ОписаниеДанных.Задание.Пустая() Тогда
					
					// Создаем задание респонденту.
					ПараметрыСоздания = Новый Структура();
					ПараметрыСоздания.Вставить("СрокИсполнения", СрокПрохождения);
					ПараметрыСоздания.Вставить("Наименование", Наименование);
					ПараметрыСоздания.Вставить("Исполнитель", ОписаниеДанных.Респондент);
					ПараметрыСоздания.Вставить("Предмет", Ссылка);
					ПараметрыСоздания.Вставить("Автор", Автор);
					
					СоздатьЗаданиеРеспондентуНаОснованииДанныхКурса(ПараметрыСоздания);
					
				ИначеЕсли ОписаниеДанных.Респондент.Пустая() Тогда
					
					// Исполнитель задачи более не входит в состав табличной части Обучающиеся.
					// Удалим предмет из задания и остановим его выполнение.
					ЗаданиеОбъект = ОписаниеДанных.Задание.ПолучитьОбъект();
					ЗаданиеОбъект.Предмет = Неопределено;
					ЗаданиеОбъект.Записать();
					Если ОписаниеДанных.Состояние = Перечисления.СостоянияБизнесПроцессов.Активен Тогда
						БизнесПроцессыИЗадачиСервер.ОстановитьБизнесПроцесс(ОписаниеДанных.Задание);
					КонецЕсли;
					
				Иначе
					
					// Актуализируем существующее задание.
					Если Наименование <> ОписаниеДанных.Наименование ИЛИ СрокПрохождения <> ОписаниеДанных.СрокИсполнения Тогда
						ЗаданиеОбъект = ОписаниеДанных.Задание.ПолучитьОбъект();
						ЗаданиеОбъект.Наименование = Наименование;
						ЗаданиеОбъект.СрокИсполнения = СрокПрохождения;
						ЗаданиеОбъект.Записать();
						ЗаданиеОбъект.ИзменитьРеквизитыНевыполненныхЗадач();
					КонецЕсли;
					
					Если ОписаниеДанных.Состояние = Перечисления.СостоянияБизнесПроцессов.Остановлен Тогда
						БизнесПроцессыИЗадачиСервер.СделатьАктивнымБизнесПроцесс(ОписаниеДанных.Задание);
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли ИдентификаторОперации = "ОтменаПроведения" Тогда
				
				Если ОписаниеДанных.Выполнено = Истина ИЛИ ОписаниеДанных.Завершен = Истина Тогда
					// Выполненные и завершенные нет возможности менять с помощью методов БСП.
					Продолжить;
				Иначе
					
					Если ОписаниеДанных.Состояние = Перечисления.СостоянияБизнесПроцессов.Активен Тогда
						БизнесПроцессыИЗадачиСервер.ОстановитьБизнесПроцесс(ОписаниеДанных.Задание);
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				ТекстОшибки = СтрШаблон("Неизвестный идентификатор операции: %1", ИдентификаторОперации);
				ВызватьИсключение(ТекстОшибки);
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		МенеджерОбработкиОшибок = Новый МенеджерОбработкиОшибок();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщенияПользователю = МенеджерОбработкиОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияПользователю, ЭтотОбъект,,, Отказ);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура СоздатьНазначениеОпросаНаОснованииДанныхКурса(ПараметрыСоздания)
	
	ШаблонНаименование = "Опрос от %1: %2";
	ШаблонКомментарий = "Служебный опрос для курса обучения %1";
	ПустаяДата = '00010101';
	
	НазначениеОпросаНовыйОбъект = Документы.НазначениеОпросов.СоздатьДокумент();
	НазначениеОпросаНовыйОбъект.ШаблонАнкеты = ПараметрыСоздания.ШаблонАнкеты;
	НазначениеОпросаНовыйОбъект.СвободныйОпрос = Ложь;
	НазначениеОпросаНовыйОбъект.ПоказыватьВАрхивеАнкет = Истина;
	НазначениеОпросаНовыйОбъект.Основание = ПараметрыСоздания.Основание;
	НазначениеОпросаНовыйОбъект.Наименование = СтрШаблон(ШаблонНаименование, ПараметрыСоздания.ОснованиеНаименование, 
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСоздания.ШаблонАнкеты, "Наименование"));
	НазначениеОпросаНовыйОбъект.Комментарий = СтрШаблон(ШаблонКомментарий, ПараметрыСоздания.ОснованиеНаименование);
	НазначениеОпросаНовыйОбъект.ДатаНачала = ПустаяДата;
	НазначениеОпросаНовыйОбъект.ДатаОкончания = ПустаяДата;
	НазначениеОпросаНовыйОбъект.ВозможностьПредварительногоСохранения = Ложь;
	НазначениеОпросаНовыйОбъект.Дата = ТекущаяДатаСеанса();
	НазначениеОпросаНовыйОбъект.Респонденты.Загрузить(ПараметрыСоздания.Респонденты);
	НазначениеОпросаНовыйОбъект.УстановитьНовыйНомер("КО");
	
	НазначениеОпросаНовыйОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Функция ПолучитьДанныеСвязанныхНазначенийОпросов(Основание)

	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(НазначениеОпросов.Ссылка, ЗНАЧЕНИЕ(Документ.НазначениеОпросов.ПустаяСсылка)) КАК НазначениеОпросаСсылка,
		|	ЕСТЬNULL(НазначениеОпросов.Проведен, ЛОЖЬ) КАК Проведен,
		|	ЕСТЬNULL(КурсОбученияШаблоныАнкет.ШаблонАнкеты, ЗНАЧЕНИЕ(Справочник.ШаблоныАнкет.ПустаяСсылка)) КАК ШаблонАнкетыСсылка
		|ИЗ
		|	Документ.КурсыОбучения.ШаблоныАнкет КАК КурсОбученияШаблоныАнкет
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.НазначениеОпросов КАК НазначениеОпросов
		|		ПО КурсОбученияШаблоныАнкет.ШаблонАнкеты = НазначениеОпросов.ШаблонАнкеты
		|			И КурсОбученияШаблоныАнкет.Ссылка = НазначениеОпросов.Основание
		|			И (НазначениеОпросов.Основание = &Основание)
		|			И (НазначениеОпросов.Основание.ПометкаУдаления = ЛОЖЬ)
		|ГДЕ
		|	(НазначениеОпросов.Основание = &Основание
		|			ИЛИ НазначениеОпросов.Основание ЕСТЬ NULL)
		|	И КурсОбученияШаблоныАнкет.Ссылка = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Процедура СоздатьЗаданиеРеспондентуНаОснованииДанныхКурса(ПараметрыСоздания)
	
	ЗаданиеОбъект = БизнесПроцессы.Задание.СоздатьБизнесПроцесс();
	ЗаполнитьЗначенияСвойств(ЗаданиеОбъект, ПараметрыСоздания);
	ЗаданиеОбъект.Содержание = ТекстСодержанияЗаданияРеспонденту(ПараметрыСоздания);
	ЗаданиеОбъект.Дата = ТекущаяДатаСеанса();
	ЗаданиеОбъект.Записать();
	ЗаданиеОбъект.Старт();
	
КонецПроцедуры

Функция ПолучитьДанныеСвязанныхЗадач(Основание, ТекущийСоставОбучающихся)

	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТекущийСоставОбучающихся.Респондент КАК Респондент
		|ПОМЕСТИТЬ ВТТекущийСоставОбучающихся
		|ИЗ
		|	&ТекущийСоставОбучающихся КАК ТекущийСоставОбучающихся
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задание.Ссылка КАК Задание,
		|	Задание.Дата КАК Дата,
		|	Задание.Завершен КАК Завершен,
		|	Задание.Выполнено КАК Выполнено,
		|	Задание.Состояние КАК Состояние,
		|	Задание.Исполнитель КАК Исполнитель,
		|	Задание.СрокИсполнения КАК СрокИсполнения,
		|	Задание.Наименование КАК Наименование
		|ПОМЕСТИТЬ ВТЗаданияПоКурсу
		|ИЗ
		|	БизнесПроцесс.Задание КАК Задание
		|ГДЕ
		|	Задание.Предмет = &Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТЗаданияПоКурсу.Задание, ЗНАЧЕНИЕ(БизнесПроцесс.Задание.ПустаяСсылка)) КАК Задание,
		|	ЕСТЬNULL(ВТТекущийСоставОбучающихся.Респондент, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Респондент,
		|	ЕСТЬNULL(ВТЗаданияПоКурсу.СрокИсполнения, ДАТАВРЕМЯ(1,1,1)) КАК СрокИсполнения,
		|	ЕСТЬNULL(ВТЗаданияПоКурсу.Наименование, """") КАК Наименование,
		|	ЕСТЬNULL(ВТЗаданияПоКурсу.Выполнено, ЛОЖЬ) КАК Выполнено,
		|	ЕСТЬNULL(ВТЗаданияПоКурсу.Завершен, ЛОЖЬ) КАК Завершен,
		|	ЕСТЬNULL(ВТЗаданияПоКурсу.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияБизнесПроцессов.ПустаяСсылка)) КАК Состояние
		|ИЗ
		|	ВТЗаданияПоКурсу КАК ВТЗаданияПоКурсу
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТТекущийСоставОбучающихся КАК ВТТекущийСоставОбучающихся
		|		ПО ВТЗаданияПоКурсу.Исполнитель = ВТТекущийСоставОбучающихся.Респондент";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("ТекущийСоставОбучающихся", ТекущийСоставОбучающихся);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция ТекстСодержанияЗаданияРеспонденту(Параметры)
	Возврат СтрШаблон("Необходимо пройти курс ""%1"" до %2", Параметры.Наименование, Параметры.СрокИсполнения);
КонецФункции

Функция ПолучитьИдентификаторОперацииПроведения()
	Возврат "Проведение";
КонецФункции

Функция ПолучитьИдентификаторОперацииОтменаПроведения()
	Возврат "ОтменаПроведения";
КонецФункции

Функция АктуализироватьРегистрДанныеРеспондентовКурсовОбучения(Отказ)
	
	Попытка
		МассивРеспондентов = Обучающиеся.Выгрузить().ВыгрузитьКолонку("Респондент");
		РегистрыСведений.ДанныеРеспондентовКурсовОбучения.АктуализироватьДанныеРегистра(Ссылка, МассивРеспондентов);
	Исключение
		
		МенеджерОбработкиОшибок = Новый МенеджерОбработкиОшибок();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщенияПользователю = МенеджерОбработкиОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияПользователю, ЭтотОбъект,,, Отказ);
		
	КонецПопытки;
	
КонецФункции

#КонецОбласти
